#4-2: while
#แบบฝึกหัด 4-2 ข้อที่ 1
#ให้เขียนโปรแกรมรับจำนวนเต็ม n จาก input เพื่อแสดงจำนวนเต็มคี่ตั้งแต่ 1 ถึงจำนวนคี่ที่ไม่เกิน n (โดยใช้วงวน while)
n = int(input())
i = 1
while i <= n:
  print(i)
  i += 2

#แบบฝึกหัด 4-2 ข้อที่ 2
#ข้อมูลที่ input มีบรรทัดแรกเป็นจำนวนเต็ม n ตามด้วยอีก n บรรทัดเป็นจำนวนเต็ม d0, d1, ..., dn-1 
#บรรทัดละจำนวน จงเขียนโปรแกรมอ่านข้อมูลจาก input (โดยใช้วงวน while) เพื่อหาผลรวมของ d0, d1, ..., dn-1
n = int(input())
k = 0
s = 0
while k < n:
    s += int(input())
    k += 1
print(s)

#แบบฝึกหัด 4-2 ข้อที่ 3
#ข้อมูลจาก input เป็นจำนวนเต็ม บรรทัดละจำนวน จงเขียนโปรแกรมรับข้อมูลจาก input (โดยใช้วงวน while) 
#เพื่อหาผลรวมของจำนวนที่อ่านเข้ามา จนพบจำนวนลบ (ไม่รวมจำนวนลบ)
s = 0
x = int(input())
while x >= 0:
    s += x
    x = int(input())
print(s)

#แบบฝึกหัด 4-2 ข้อที่ 4
#ข้อมูลจาก input เป็นจำนวนเต็ม บรรทัดละจำนวน จนถึงบรรทัดสุดท้ายจะเป็นคำว่า end จงเขียนโปรแกรมรับข้อมูลจาก input (โดยใช้วงวน while) 
#เพื่อหาผลรวมของจำนวนที่อ่านเข้ามา จนพบคำว่า end
s = 0
x = input()
while x != "end":
    s += int(x)
    x = input()
print(s)

#แบบฝึกหัด 4-2 ข้อที่ 5
#อ่านจำนวนเต็ม n จาก input แล้วเขียนคำสั่งเพื่อคำนวณและแสดงค่าของ ∑^ni=1i^5 (โดยใช้วงวน while)
n = int(input())
s = 0
i = 1
while i <= n:
  s += i**5
  i += 1
print(s)

#แบบฝึกหัด 4-2 ข้อที่ 6
#อ่านสตริง t จาก input เพื่อนับและแสดงว่ามีสระใน t กี่ตัว (นับทั้งตัวเล็กและตัวใหญ่ โดยใช้วงวน while) เช่น Anna มีสระเป็นจำนวน 2 ตัว 
#แบบฝึกหัดของบทก่อน เราจำกัดขนาดของ t แค่ 5 ตัวอักษร แล้วก็ยังไม่ได้เรียนเรื่องวงวน ก็เขียนเป็นคำสั่งได้ดังข้างล่างนี้ จะเห็นว่ามีคำสั่งที่ทำงานในรูปแบบซ้ำ ๆ กัน ก็นำมาทำในวงวนได้
# t = input()
#            c = 0
#            vowels = "aeiouAEIOU"
#            if t[0] in vowels:
#                c += 1
#            if t[1] in vowels:
#                c += 1
#            if t[2] in vowels:
#                c += 1
#            if t[3] in vowels:
#                c += 1
#            if t[4] in vowels:
#               c += 1
#            print(c)
t = input()
c = 0
vowels = "aeiouAEIOU"
k = 0
while k < len(t):
    if t[k] in vowels:
        c += 1
    k += 1
print(c)
