#3-3: List and String Comparison
#แบบฝึกหัด 3-3 ข้อที่ 1
#เขียนคำสั่งตามที่แสดงใน comment เช่น ถ้าโจทย์ให้แสดงผลการเปรียบเทียบว่า a เป็น 0 หรือไม่ ก็เขียนคำสั่ง print(a == 0)
# แสดงผลของการเปรียบเทียบว่า s เป็น
#   สตริงที่ขึ้นต้นด้วยตัวอักษรอังกฤษตัวใหญ่ 
#   และลงท้ายด้วยตัวเล
print("A" <= s[0] <= "Z" and "0" <= s[-1] <= "9")

#แบบฝึกหัด 3-3 ข้อที่ 1
#มีตัวแปร d1, m1, y1 กับ d2, m2, y2 ให้แล้ว เก็บวันเดือนปีเกิดของ Tom กับ Jerry ตามลำดับ จงแสดงว่า Tom หรือ Jerry ใครเกิดก่อน (ให้ถือว่าไม่มีกรณีเกิดวันเดือนปีเดียวกัน)
if [y1,m1,d1] < [y2,m2,d2]:
  print("Tom")
else:
  print("Jerry")
