#3-2: Relational Operator
#แบบฝึกหัด 3-2 ข้อที่ 1
#เขียนคำสั่งตามที่แสดงใน comment เช่น ถ้าโจทย์ให้แสดงผลการเปรียบเทียบว่า a เป็น 0 หรือไม่ ก็เขียนคำสั่ง print(a == 0)
# แสดงผลของการเปรียบเทียบว่า a เป็นจำนวนลบหรือไม่
print(a < 0)

#แบบฝึกหัด 3-2 ข้อที่ 2
# แสดงผลของการเปรียบเทียบว่า h
#  เป็นเลขชั่วโมงบนหน้าปัดนาฬิกาหรือไม่
print(1<=h<=12)

#แบบฝึกหัด 3-2 ข้อที่ 3
# แสดงผลของการเปรียบเทียบว่า m เป็น
#  จำนวนเต็มบวกคี่ที่หารด้วย 3 ลงตัวหรือไม่
print(m>0 and m%2 == 1 and m%3 == 0)

#แบบฝึกหัด 3-2 ข้อที่ 4
# แสดงผลของการเปรียบเทียบว่า url เก็บ
#  ชื่อเว็บไซต์ที่ลงท้ายด้วย .com หรือ .th หรือไม่
print(url[-4:] == '.com' or url[-3:] == '.th')