#1-2: String, Number and print()
#แบบฝึกหัด บทที่1-2 ข้อที่ 1
#สลับลำดับคำสั่งในโปรแกรมข้างล่างนี้ เพื่อให้แสดงรูปที่น่าสนใจ
#print('(")_(")   ("")-("")')
#print("          (”)….(”) ")
#print('( •,•)     (")-(")  ')
#print("(\_/)     ( ' o ') ")
print("          (”)….(”) ")
print("(\_/)     ( ' o ') ")
print('( •,•)     (")-(")  ')
print('(")_(")   ("")-(""-')

#แบบฝึกหัด บทที่1-2 ข้อที่ 2
#ใช้คำสั่ง print แสดงข้อความ This is easy ในบรรทัดแรกและแสดงค่าที่เท่ากับ 1.963 x 1034 ในบรรทัดที่สอง
print("This is easy")
print(1.963e34)