#1-5: Type Conversion
#แบบฝึกหัด 1-5 ข้อที่ 1
# x = [1,2,3]
# y = [4,5,6]
# แปลง x ให้เป็นสตริง และ
# นำมาต่อด้วยสตริงที่ได้จาก
# การแปลง y ให้เป็นสตริง 
# เก็บผลลัพธิ์ในตัวแปร t

x = [1,2,3]
y = [4,5,6]
t = str(x) + str(y)
print(t)

#แบบฝึกหัด 1-5 ข้อที่ 2
# มีตัวแปร x ที่เป็นสตริง กับ y ที่เป็น float มาให้แล้ว
# แปลง x ให้เป็นจำนวนเต็ม เก็บในตัวแปร x1 โดยใช้ int
# แปลง y ให้เป็นจำนวนเต็ม เก็บในตัวแปร y1 โดยใช้ int
# ให้ตัวแปร t เก็ยผลรวมของค่าใน x1 กับ y
x = 20
y = 50.0
x1 = int(x)
y1 = int(y)
t = x1+y1
print (t)